import React from 'react'
import './Faq.css'

function Faq() {
  return (
    <div className='faq container'>
      <div className='faq-item'>
        <h2 className='mb-4'>الأسئلة الشائعة</h2>
        
        <h5 className='mb-3'>متى سيصل طلبي؟</h5>
        <p>يعتمد موعد وصول الطلب على شركة الشحن المختارة. نحن نعمل مع وكلاء توصيل في عدد من المدن الكبرى داخل الجزائر، ويستغرق التوصيل عادةً من يوم إلى 3 أيام بعد تأكيد الطلب.</p>
      </div>

      <div className='faq-item'>
        <h5 className='mb-3'>هل يتوفر توصيل خارج الجزائر؟</h5>
        <p>حاليًا، خدمات الشحن متوفرة فقط داخل الجزائر وتشمل كافة الولايات والمدن الكبرى.</p>
      </div>

      <div className='faq-item'>
        <h5 className='mb-3'>هل توجد خصومات على الكميات الكبيرة؟</h5>
        <p>نعم، نوفر خصومات تصل إلى 15٪ على بعض المنتجات عند طلب كميات كبيرة. يُرجى التواصل معنا مباشرةً للحصول على التفاصيل والمزايا المتاحة حسب الكمية المطلوبة.</p>
      </div>

      <div className='faq-item'>
        <h5 className='mb-3'>ماذا أفعل في حال وجود عيب في المنتج؟</h5>
        <p>يمكنك طلب استبدال المنتج خلال يومين من الاستلام، بشرط أن يكون بحالته الأصلية ومغلفًا كما تم استلامه. يُرجى تصوير المنتج وإرسال الصورة مع تفاصيل المدينة، العنوان، ورقم الطلب حتى نتمكن من استبداله بسرعة.</p>
      </div>
    </div>
  )
}

export default Faq