import React from 'react'
import './Terms.css'

function Terms() {
  return (
    <div className='terms container'>
      <div className='term-item'>
        <h2 className='mb-4'>شروط الاستخدام</h2>

        <h5 className='mb-3'>المقدمة</h5>
        <p>
          عند دخولك إلى هذا الموقع، فإنك توافق على الالتزام بالشروط والأحكام الموضحة أدناه. إذا كنت غير موافق على أي جزء من هذه الشروط، يُرجى عدم استخدام الموقع. 
          قد نقوم بتعديل أو تحديث هذه الشروط في أي وقت، وتصبح التغييرات سارية فور نشرها هنا دون إشعار مسبق. نوصي بمراجعتها دوريًا، حيث يُعد استمرار استخدامك للموقع بمثابة موافقة ضمنية على التعديلات.
        </p>
      </div>

      <div className='term-item'>
        <h5 className='mb-3'>استخدام الموقع</h5>
        <p>
          يجب أن يكون عمرك 18 عامًا أو أكثر لاستخدام هذا الموقع، أو أن تتم الزيارة تحت إشراف أحد الوالدين أو الوصي القانوني. باستخدامك الموقع، فإنك تقر بأن جميع المعلومات التي تقدمها دقيقة وحديثة.
        </p>
      </div>

      <div className='term-item'>
        <h5 className='mb-3'>الطلبات والتسعير</h5>
        <p>
          في بعض الحالات، قد نضطر إلى إلغاء الطلبات لأسباب مختلفة، مثل محدودية التوفر أو أخطاء في المعلومات. نحتفظ بالحق في رفض أو إلغاء أي طلب في أي وقت، حتى بعد تأكيده.
        </p>
        <p>
          نبذل أقصى جهد لتقديم معلومات دقيقة عن الأسعار، لكن قد تحدث أخطاء. في حال تم إدراج سعر غير صحيح، نحتفظ بحقنا في إلغاء الطلب أو التواصل معك لتوضيح الخطأ والحصول على تأكيدك قبل المتابعة.
        </p>
      </div>

      <div className='term-item'>
        <h5 className='mb-3'>الملكية الفكرية</h5>
        <p>
          جميع الحقوق الفكرية المتعلقة بالموقع ومحتواه، سواء كانت مسجلة أم لا، مملوكة لنا بالكامل. يشمل ذلك التصاميم، الكود البرمجي، النصوص، الصور، وكل ما يظهر ضمن الموقع. لا يجوز نسخ أو إعادة استخدام أي جزء من المحتوى دون إذن خطي مسبق.
        </p>
      </div>

      <div className='term-item'>
        <h5 className='mb-3'>القوانين السارية</h5>
        <p>
          تخضع هذه الشروط والأحكام لقوانين الدولة الجزائرية. في حال نشوء أي نزاع قانوني، تُحل القضايا أمام المحاكم المختصة داخل الجزائر، ويُعد كل طرف متنازلًا عن أي اعتراض بخصوص اختصاص المكان.
        </p>
      </div>
    </div>
  )
}

export default Terms
