// Confirm.jsx
import React, { useState , useEffect} from 'react';
import './Confirm.css';
import Order from '../../Components/Card/Order';
import { Link } from 'react-router-dom';
import Loader from '../Loader/Loader';

const deliveryPrices = {
  "1 - أدرار": { home: 1350, office: 900 },
  "2 - الشلف": { home: 700, office: 400 },
  "3 - الأغواط": { home: 850, office: 550 },
  "4 - أم البواقي": { home: 700, office: 400 },
  "5 - باتنة": { home: 700, office: 400 },
  "6 - بجاية": { home: 700, office: 400 },
  "7 - بسكرة": { home: 850, office: 550 },
  "8 - بشار": { home: 1350, office: 900 },
  "9 - البليدة": { home: 600, office: 400 },
  "10 - البويرة": { home: 700, office: 400 },
  "11 - تمنراست": { home: 1550, office: 1300 },
  "12 - تبسة": { home: 850, office: 550 },
  "13 - تلمسان": { home: 700, office: 400 },
  "14 - تيارت": { home: 700, office: 400 },
  "15 - تيزي وزو": { home: 700, office: 400 },
  "16 - الجزائر": { home: 400, office: 400 },
  "17 - الجلفة": { home: 850, office: 550 },
  "18 - جيجل": { home: 700, office: 400 },
  "19 - سطيف": { home: 700, office: 400 },
  "20 - سعيدة": { home: 700, office: 400 },
  "21 - سكيكدة": { home: 700, office: 400 },
  "22 - سيدي بلعباس": { home: 700, office: 400 },
  "23 - عنابة": { home: 700, office: 400 },
  "24 - قالمة": { home: 700, office: 400 },
  "25 - قسنطينة": { home: 700, office: 400 },
  "26 - المدية": { home: 700, office: 400 },
  "27 - مستغانم": { home: 700, office: 400 },
  "28 - المسيلة": { home: 700, office: 400 },
  "29 - معسكر": { home: 700, office: 400 },
  "30 - ورقلة": { home: 850, office: 550 },
  "31 - وهران": { home: 700, office: 400 },
  "32 - البيض": { home: 1350, office: 900 },
  "33 - إليزي": { home: 1550, office: 1300 },
  "34 - برج بوعريريج": { home: 700, office: 400 },
  "35 - بومرداس": { home: 600, office: 400 },
  "36 - الطارف": { home: 700, office: 400 },
  "37 - تندوف": { home: 1550, office: 1300 },
  "38 - تيسمسيلت": { home: 700, office: 400 },
  "39 - الوادي": { home: 850, office: 550 },
  "40 - خنشلة": { home: 700, office: 400 },
  "41 - سوق أهراس": { home: 700, office: 400 },
  "42 - تيبازة": { home: 600, office: 400 },
  "43 - ميلة": { home: 700, office: 400 },
  "44 - عين الدفلى": { home: 700, office: 400 },
  "45 - النعامة": { home: 1350, office: 900 },
  "46 - عين تموشنت": { home: 700, office: 400 },
  "47 - غرداية": { home: 850, office: 550 },
  "48 - غليزان": { home: 700, office: 400 },
  "49 - تيميمون": { home: 1300, office: 850 },
  "50 - برج باجي مختار": { home: 1300, office: 850 },
  "51 - أولاد جلال": { home: 900, office: 500 },
  "52 - بني عباس": { home: 1300, office: 850 },
  "53 - عين صالح": { home: 1500, office: 1250 },
  "54 - عين قزام": { home: 1500, office: 1250 },
  "55 - تقرت": { home: 900, office: 500 },
  "56 - جانت": { home: 1500, office: 1250 },
  "57 - المغير": { home: 900, office: 500 },
  "58 - المنيعة": { home: 900, office: 500 },
};

const communes = {
  "1 - أدرار": [
    "أدرار", "اقبلي", "أولف", "بودة", "فنوغيل", "إن زغمير", "أولاد أحمد تيمي", "رقان", "سالي",
    "السبع", "تامنطيت", "تامست", "تيمقتن", "تيت", "تسابيت", "زاوية كنتة"
  ],
  "2 - الشلف": [
    "أبو الحسن", "عين مران", "بنايرية", "بني بوعتاب", "بني حواء", "بني راشد", "بوقادير",
    "بوزغاية", "بريرة", "الشطية", "الشلف", "الظهرة", "الحجاج", "الكريمية", "المرسى",
    "حرشون", "الهرانفة", "الأبيض مجاجة", "مصدق", "وادي الفضة", "وادي قوسين", "وادي سلي",
    "أولاد عباس", "أولاد بن عبد القادر", "أولاد فارس", "أم الدروع", "سنجاس",
    "سيدي عبد الرحمن", "سيدي عكاشة", "الصبحة", "تاجنة", "تلعصة", "تاوقريت", "تنس", "الزبوجة"
  ],
  "3 - الأغواط": [
    "أفلو", "عين ماضي", "عين سيدي علي", "البيضاء", "بن ناصر بن شهرة", "بريدة",
    "العسافية", "الغيشة", "الحويطة", "قلتة سيدي سعد", "الحاج مشري", "حاسي الدلاعة",
    "حاسي الرمل", "الخنق", "قصر الحيران", "الأغواط", "وادي مرة", "وادي مزي",
    "سبقاق", "سيدي بوزيد", "سيدي مخلوف", "تاجموت", "تاجرونة", "تاويالة"
  ],
  "4 - أم البواقي": [
    "عين ببوش", "عين البيضاء", "عين الديس", "عين فكرون", "عين كرشة", "عين مليلة",
    "عين الزيتون", "بحير الشرقي", "بريش", "بئر الشهد", "الضلعة", "العامرية",
    "البلالة", "الجازية", "الفجوج بوغرارة سعودي", "الحرملية", "فكيرينة", "هنشير تومغني",
    "قصر الصباحي", "مسكيانة", "وادي نيني", "أولاد قاسم", "أولاد حملة", "أولاد زواي",
    "أم البواقي", "الرحية", "سيقوس", "سوق نعمان", "الزرق"
  ],
  "5 - باتنة": [
    "عين جاسر", "عين التوتة", "عين ياقوت", "آريس", "عزيل عبد القادر", "بريكة",
    "باتنة", "بني فضالة الحقانية", "بيطام", "بولهيلات", "بومقر", "بومية",
    "بوزينة", "الشمرة", "شير", "جرمة", "الجزار", "الحاسي", "المعذر", "فسديس",
    "فم الطوب", "غسيرة", "القصبات", "القيقبة", "حيدوسة", "إشمول", "إينوغيسن",
    "كيمل", "قصر بلزمة", "لارباع", "لازرو", "لمسان", "إمدوكل", "معافة", "منعة",
    "مروانة", "نقاوس", "وادي الشعبة", "وادي الماء", "وادي الطاقة", "أولاد عمار",
    "أولاد عوف", "أولاد فاضل", "أولاد سلام", "أولاد سي سليمان", "عيون العصافير",
    "الرحبات", "رأس العيون", "سفيان", "سقانة", "سريانة", "تكوت", "تالخمت",
    "تاكسلانت", "تازولت", "ثنية العابد", "تيغانمين", "تغرغار", "تيلاطو",
    "تيمقاد", "زانة البيضاء"
  ],
  "6 - بجاية": [ "آدكار", "آيت رزين", "آيت إسماعيل", "آقبو", "أكفادو", "أمالو", "أميزور",
    "أوقاس", "برباشة", "بجاية", "بني جليل", "بني كسيلة", "بني مليكش", "بني معوش",
    "بوجليل", "بوحمزة", "بوخليفة", "شلاطة", "شميني", "درقينة", "ذراع القايد",
    "الفلاي", "القصر", "فناية الماثن", "فرعون", "أوزلاقن", "إغيل علي", "اغرم",
    "كنديرة", "خراطة", "مسيسنة", "مالبو", "وادي غير", "صدوق", "سيدي عياد",
    "سيدي عيش", "سمعون", "سوق لإثنين", "سوق اوفلا", "تالة حمزة", "تامقرة",
    "تامريجت", "تاوريرت إغيل", "تاسكريوت", "تازمالت", "طيبان", "تيشي",
    "تيفرة", "تيمزريت", "تينبدار", "تيزي نبربر", "توجة" 
  ],
  "7 - بسكرة": [ "عين الناقة", "عين زعطوط", "بسكرة", "برج بن عزوز", "بوشقرون", "برانيس",
    "شتمة", "جمورة", "الفيض", "الغروس", "الحاجب", "الحوش", "القنطرة", "الوطاية",
    "فوغالة", "خنقة سيدي ناجي", "ليشانة", "ليوة", "مشونش", "مخادمة", "المزيرعة",
    "مليلي", "أوماش", "أورلال", "سيدي عقبة", "طولقة", "زريبة الوادي"
  ],
  "8 - بشار": [ "العبادلة", "بشار", "بني ونيف", "بوكايس", "عرق فراج", "لقنادسة",
    "لحمر", "مشرع هواري بومدين", "المريجة", "موغل", "تاغيت" 
  ],
  "9 - البليدة": [ "عين الرمانة", "بني مراد", "بني تامو", "بن خليل", "البليدة",
    "بوعرفة", "بوفاريك", "بوقرة", "بوعينان", "الشبلي", "الشفة", "الشريعة",
    "جبابرة", "العفرون", "قرواو", "حمام ملوان", "الأربعاء", "مفتاح", "موزاية",
    "وادي جر", "وادي العلايق", "أولاد سلامة", "أولاد يعيش", "صوحان", "الصومعة"
  ],
  "10 - البويرة": [ "أغبالو", "أهل القصر", "عين الحجر", "عين العلوي", "عين الترك",
    "عين بسام", "آيت لعزيز", "أعمر", "بشلول", "بئر غبالو", "برج أوخريص", "بودربالة",
    "البويرة", "بوكرم", "شرفة", "الدشمية", "ديرة", "جباحية", "العجيبة", "الأسنام",
    "الهاشمية", "الخبوزية", "الحاكمية", "المقراني", "قرومة", "الحجرة الزرقاء",
    "حيزر", "حنيف", "القادرية", "الخضارية", "أمشدالة", "معلة", "المعمورة",
    "مزدور", "وادي البردي", "أولاد راشد", "روراوة", "ريدان", "سحاريج", "سوق الخميس",
    "سوق الغزلان", "تاغزوت", "تاقديت", "آث منصور", "زبربر" 
  ],
  "11 - تمنراست": [ "أبلسة", "عين امقل", "أدلس", "تمنراست", "تاظروك"
  ],
  "12 - تبسة": [ "عين الزرقاء", "بجن", "بكارية", "بئر الذهب", "بئر مقدم",
    "بئر العاتر", "بوخضرة", "بولحاف الدير", "الشريعة", "الكويف", "الماء الأبيض",
    "المريج", "المزرعة", "العقلة", "العقلة المالحة", "العوينات", "الحويجبات",
    "فركان", "قريقر", "الحمامات", "مرسط", "نقرين", "الونزة", "أم علي",
    "صفصاف الوسرى", "سطح قنطيس", "تبسة", "ثليجان"
  ],
    "13 - تلمسان": [ "عين فتاح", "عين فزة", "عين غرابة", "عين الكبيرة", "عين النحالة",
    "عين تالوت", "عين يوسف", "عمير", "باب العسة", "بني بهدل", "بني بوسعيد",
    "بني خلاد", "بني مستر", "بني وارسوس", "بني صميل", "بني سنوس", "بن سكران",
    "بوحلو", "البويهي", "شتوان", "دار يغمراسن", "جبالة", "العريشة", "العزايل",
    "الفحول", "القور", "فلاوسن", "الغزوات", "حمام بوغرارة", "الحناية", "هنين",
    "مغنية", "منصورة", "مرسى بن مهيدي", "مسيردة الفواقة", "ندرومة", "وادي الخضر",
    "أولاد ميمون", "أولاد رياح", "الرمشي", "صبرة", "سبعة شيوخ", "سبدو",
    "سيدي العبدلي", "سيدي الجيلالي", "سيدي مجاهد", "السواحلية", "السواني",
    "سوق الثلاثاء", "تيرني بني هديل", "تيانت", "تلمسان", "زناتة"
  ],
  "14 - تيارت": [ "عين بوشقيف", "عين الذهب", "عين تزاريت", "عين الحديد", "عين كرمس",
    "بوقرة", "شحيمة", "دحموني", "جبيلات الرصفاء", "جيلالي بن عمار", "الفايجة",
    "فرندة", "قرطوفة", "حمادية", "قصر الشلالة", "مادنة", "مهدية", "مشرع الصفا",
    "مدريسة", "مدروسة", "مغيلة", "ملاكو", "الناظورة", "النعيمة", "وادي ليلي",
    "الرحوية", "الرشايقة", "السبعين", "السبت", "سرغين", "سي عبد الغني",
    "سيدي عبد الرحمن", "سيدي علي ملال", "سيدي بختي", "سيدي حسني", "السوقر",
    "تاقدمت", "تخمرت", "تيارت", "تيدة", "توسنينة", "زمالة الأمير عبد القادر"
  ],
    "15 - تيزي وزو": [ "أبي يوسف", "أغريب", "أقني قغران", "عين الحمام", "عين الزاوية",
    "آيت عقواشة", "آيت بوادو", "آيت بومهدي", "آيت خليلي", "آيت يحي موسى",
    "آيت عيسى ميمون", "آيت شافع", "آيت محمود", "آيت أومالو", "آيت تودرت",
    "آيت يحي", "أقبيل", "أقرو", "أسي يوسف", "عزازقة", "أزفون", "بني زمنزار",
    "بني عيسي", "بني دوالة", "بني يني", "بني زيكي", "بوغني", "بوجيمة",
    "بونوح", "بوزقن", "ذراع بن خدة", "ذراع الميزان", "فريحة", "فريقات",
    "إبودرارن", "إيجار", "إفرحونان", "إيفيغاء", "إفليسن", "إيليلتن",
    "إيلولة أومالو", "إمسوحال", "إيرجن", "الأربعاء ناث إيراثن", "معاتقة",
    "ماكودة", "مشطراس", "مقلع", "ميزرانة", "مكيرة", "واسيف", "واضية",
    "واقنون", "سيدي نعمان", "صوامع", "سوق الإثنين", "تادمايت", "تيقزيرت",
    "تيميزار", "تيرمتين", "تيزي نثلاثة", "تيزي غنيف", "تيزي وزو",
    "تيزي راشد", "إعكورن", "يطافن", "زكري"
  ],
    "16 - الجزائر": [ "عين بنيان", "عين طاية", "الجزائر الوسطى", "باب الوادي", "باب الزوار",
    "بابا حسن", "باش جراح", "براقي", "ابن عكنون", "بني مسوس", "بئر مراد رايس",
    "بئر خادم", "بئر توتة", "بولوغين بن زيري", "برج البحري", "برج الكيفان",
    "بوروبة", "بوزريعة", "القصبة", "الشراقة", "الدار البيضاء", "دالي ابراهيم",
    "جسر قسنطينة", "الدويرة", "الدرارية", "العاشور", "الابيار", "الحراش",
    "المدنية", "المغارية", "المرسى", "المرادية", "الحمامات", "هراوة",
    "حسين داي", "حيدرة", "الخرايسية", "القبة", "الكاليتوس", "المعالمة",
    "محمد بلوزداد", "المحمدية", "وادي قريش", "وادي السمار", "أولاد شبل",
    "أولاد فايت", "الرحمانية", "الرايس حميدو", "رغاية", "الرويبة",
    "السحاية", "سيدي امحمد", "سيدي موسى", "سويدانية", "سطاوالي",
    "تسالة المرجة", "زرالدة"
  ],
  "17 - الجلفة": [ "عين الشهداء", "عين الإبل", "عين فقه", "عين معبد", "عين وسارة",
    "عمورة", "بنهار", "بن يعقوب", "بيرين", "بويرة الأحداب", "الشارف",
    "دار الشيوخ", "دلدول", "الجلفة", "دويس", "القديد", "الادريسية",
    "الخميس", "فيض البطمة", "قرنيني", "قطارة", "حد الصحاري", "حاسي بحبح",
    "جاسي العش", "حاسي فدول", "مسعد", "مليليحة", "مجبارة", "أم العظام",
    "سد الرحال", "سلمانة", "سيدي بايزيد", "سيدي لعجال", "تعظميت",
    "زعفران", "زكار"
  ],
  "18 - جيجل": [ "برج الطهر", "بودريعة بني ياجيس", "بوراوي بلهادف", "بوسيف أولاد عسكر",
    "الشحنة", "الشقفة", "الجمعة بني حبيبي", "جيملة", "العنصر", "العوانة",
    "القنار نشفي", "الميلية", "الأمير عبد القادر", "أراقن سويسي", "غبالة",
    "جيجل", "قاوس", "خيري واد عجول", "وجانة", "أولاد رابح", "أولاد يحيى خدروش",
    "سلمى بن زيادة", "السطارة", "سيدي عبد العزيز", "سيدي معروف", "الطاهير",
    "تاكسنة", "زيامة منصورية"
  ],
  "19 - سطيف": [ "عين عباسة", "عين أرنات", "عين آزال", "عين الكبيرة", "عين الحجر",
    "عين ولمان", "عين لقراج", "عين الروى", "عين السبت", "آيت نوال مزادة",
    "آيت تيزي", "عموشة", "بابور", "بازر سكرة", "بيضاء برج", "بلاعة",
    "بني شبانة", "بني فودة", "بني ورتيلان", "بني وسين", "بني عزيز",
    "بني موحلي", "بئر حدادة", "بئر العرش", "بوعنداس", "بوقاعة",
    "بوسلام", "بوطالب", "الدهامشة", "جميلة", "ذراع قبيلة", "العلمة",
    "الأورسيا", "الولجة", "قلال", "قلتة زرقاء", "قنزات", "قجال",
    "حمام السخنة", "الحامة", "حمام قرقور", "حربيل", "قصر الابطال",
    "معاوية", "ماوكلان", "مزلوق", "واد البارد", "أولاد عدوان",
    "أولاد صابر", "أولاد سي أحمد", "أولاد تبان", "الرصفة",
    "صالح باي", "سرج الغول", "سطيف", "تاشودة", "تالة إيفاسن",
    "الطاية", "التلة", "تيزي نبشار"
  ],
  "20 - سعيدة": [ "عين الحجر", "عين السخونة", "عين السلطان", "دوي ثابت",
    "الحساسنة", "هونت", "المعمورة", "مولاي العربي", "أولاد إبراهيم",
    "أولاد خالد", "سعيدة", "سيدي أحمد", "سيدي عمر", "سيدي بوبكر",
    "تيرسين", "يوب"
  ],
  "21 - سكيكدة": [ "عين بوزيان", "عين شرشار", "عين قشرة", "عين زويت",
    "عزابة", "بكوش لخضر", "بن عزوز", "بني بشير", "بني ولبان",
    "بني زيد", "بين الويدان", "بوشطاطة", "الشرايع", "القل",
    "جندل سعدي محمد", "الحروش", "الغدير", "الحدائق", "المرسى",
    "مجاز الدشيش", "السبت", "فلفلة", "حمادي كرومة", "قنواع",
    "الكركرة", "خناق مايو", "وادي الزهور", "الولجة بولبلوط",
    "أولاد عطية", "أولاد حبابة", "أم الطوب", "رمضان جمال",
    "صالح بو الشعور", "سيدي مزغيش", "سكيكدة", "تمالوس",
    "زردازة", "الزيتونة"
  ],
  "22 - سيدي بلعباس": [ "عين البرد", "عين قادة", "عين الثريد", "عين تندمين",
    "عين عدان", "العمارنة", "بضرابين المقراني", "بلعربي", "بن باديس",
    "بن عشيبة شلية", "بئر الحمام", "بوجبهة البرج", "بوخنفيس",
    "شيطوان البلايلة", "الضاية", "الحصيبة", "حاسي دحو",
    "حاسي زهانة", "لمطار", "مكدرة", "مرحوم", "مسيد", "مرين",
    "مزاورو", "مصطفى بن ابراهيم", "مولاي سليسن", "وادي السبع",
    "وادي سفيون", "وادي تاوريرة", "راس الماء", "رجم دموش",
    "السهالة الثورة", "سفيزف", "سيدي علي بن يوب", "سيدي علي بوسيدي",
    "سيدي بلعباس", "سيدي ابراهيم", "سيدي شعيب", "سيدي دحو الزاير",
    "سيدي حمادوش", "سيدي خالد", "سيدي لحسن", "سيدي يعقوب",
    "طابية", "تاودموت", "تفسور", "تغاليمت", "تلاغ", "تنيرة",
    "تسالة", "تلموني", "زروالة"
  ],
  "23 - عنابة": [ "عين الباردة", "عنابة", "برحال", "شطايبي", "الشرفة",
    "البوني", "العلمة", "الحجار", "واد العنب", "سرايدي",
    "سيدي عمار", "التريعات"
  ],
  "24 - قالمة": [ "عين بن بيضاء", "عين العربي", "عين مخلوف", "عين رقادة",
    "عين صندل", "بلخير", "عين جراح", "بني مزلين", "برج صباط",
    "بوحشانة", "بوحمدان", "بوعاتي محمود", "بوشقوف", "بومهرة أحمد",
    "الدهوارة", "جبالة الخميسي", "الفجوج", "قلعة بوصبع", "قالمة",
    "حمام دباغ", "حمام النبايل", "هيليوبوليس", "نشماية", "لخزارة",
    "مجاز عمار", "مجاز الصفاء", "هواري بومدين", "وادي الشحم",
    "وادي فراغة", "وادي الزناتي", "رأس العقبة", "الركنية",
    "سلاوة عنونة", "تاملوكة"
  ],
  "25 - قسنطينة": [ "عين عبيد", "عين السمارة", "ابن باديس الهرية", "بني حميدان",
    "قسنطينة", "ديدوش مراد", "الخروب", "حامة بوزيان", "ابن زياد",
    "بوجريو مسعود", "أولاد رحمون", "زيغود يوسف"
  ],
  "26 - المدية": [ "عين بوسف", "عين اقصير", "العيساوية", "عزيز", "بطعة",
    "بن شكاو", "بني سليمان", "البرواقية", "بئر بن عابد", "بوغار",
    "بوعيش", "بوعيشون", "بوشراحيل", "بوغزول", "بوسكن", "الشهبونية",
    "شلالة العذاورة", "شنقيل", "دراق", "جواب", "ذراع السمار",
    "العزيزية", "القلب الكبير", "الحمدانية", "الحوضان", "العمارية",
    "العوينات", "حناشة", "الكاف الاخضر", "خمس جوامع", "قصر البخاري",
    "مغراوة", "المدية", "مجبر", "مزغنة", "مفاتحة", "ميهوب", "عوامري",
    "وادي حربيل", "أولاد عنتر", "أولاد بوعشرة", "أولاد إبراهيم",
    "أولاد دايد", "أولاد معرف", "أولاد هلال", "أم الجليل", "وزرة",
    "الربعية", "السانق", "سدراية", "سغوان", "سي المحجوب",
    "سيدي دامد", "سيدي نعمان", "سيدي الربيع", "سيدي زهار",
    "سيدي زيان", "السواقي", "تابلاط", "تفراوت", "تمسقيدة",
    "تيزي مهدي", "ثلاث دوائر", "الزبيرية"
  ],
    "27 - مستغانم": [ "عشعاشة", "عين بودينار", "عين نويسي", "عين سيدي الشريف",
    "عين تادلس", "بن عبد المالك رمضان", "بوقيراط", "فرناقة", "حجاج",
    "حاسي ماماش", "الحسيان", "خضرة", "خير الدين", "منصورة",
    "مزغران", "ماسرة", "مستغانم", "نكمارية", "وادي الخير",
    "أولاد بوغالم", "أولاد مع الله", "صفصاف", "صيادة",
    "سيدي علي", "سيدي بلعطار", "سيدي لخضر", "سيرات",
    "السوافلية", "سور", "ستيدية", "تزقايت", "الطواهرية"
  ],
  "28 - المسيلة": [ "عين الحجل", "عين الملح", "عين فارس", "عين خضراء",
    "عين الريش", "بلعايبة", "بن سرور", "بني يلمان", "بن زوه",
    "برهوم", "بئر فضة", "بوسعادة", "بوطي السايح", "شلال",
    "دهاهنة", "جبل مساعد", "الهامل", "الحوامد", "حمام الضلعة",
    "خطوطي سد الجير", "خبانة", "المعاضيد", "معاريف", "مقرة",
    "مسيف", "امجدل", "مناعة", "محمد بوضياف", "المسيلة",
    "المطارفة", "ونوغة", "أولاد عدي لقبالة", "أولاد دراج",
    "أولاد ماضي", "أولاد منصور", "أولاد سيدي ابراهيم",
    "أولاد سليمان", "ولتام", "سيدي عيسى", "سيدي عامر",
    "سيدي هجرس", "سيدي امحمد", "سليم", "السوامع",
    "تامسة", "تارمونت", "زرزور"
  ],
  "29 - معسكر": [ "عين فارس", "عين فكان", "عين فراح", "عين أفرص",
    "العلايمية", "عوف", "بنيان", "بوهني", "بوحنيفية", "الشرفاء",
    "البرج", "القعدة", "الغمري", "القطنة", "الحشم", "القرط",
    "المأمونية", "المنور", "فراقيق", "فروحة", "غروس", "غريس",
    "قرجوم", "حسين", "خلوية", "ماقضة", "ماوسة", "معسكر",
    "المطمور", "مقطع الدوز", "المحمدية", "نسمط", "عكاز",
    "وادي الأبطال", "وادي التاغية", "رأس عين عميروش", "سجرارة",
    "السهايلية", "سيدي عبد الجبار", "سيدي عبد المومن",
    "سيدي بوسعيد", "سيدي قادة", "سيق", "تيغنيف", "تيزي",
    "زهانة", "زلامطة"
  ],
  "30 - ورقلة": [ "عين البيضاء", "البرمة", "حاسي بن عبد الله", "حاسي مسعود",
    "انقوسة", "ورقلة", "الرويسات", "سيدي خويلد"
  ],
    "31 - وهران": [ "عين البية", "عين الكرمة", "عين الترك", "أرزيو",
    "بن فريحة", "بطيوة", "بئر الجير", "بوفاتيس", "بوسفر",
    "بوتليليس", "العنصر", "البراية", "الكرمة", "السانية",
    "قديل", "حاسي بن عقبة", "حاسي بونيف", "حاسي مفسوخ",
    "مرسى الحجاج", "المرسى الكبير", "مسرغين", "وهران",
    "وادي تليلات", "سيدي بن يبقى", "سيدي الشحمي", "طفراوي"
  ],
    "32 - البيض": [ "عين العراك", "اربوات", "بوعلام", "بوقطب",
    "بوسمغون", "بريزينة", "الشقيق", "شلالة", "البيض",
    "الأبيض سيدي الشيخ", "البنود", "الخيثر", "المحرة",
    "الغاسول", "الكاف الأحمر", "كراكدة", "رقاصة",
    "سيدي عامر", "سيدي سليمان", "سيدي طيفور",
    "ستيتن", "توسمولين"
  ],
  "33 - إليزي": [ "برج عمر إدريس", "دبداب", "إليزي", "إن أميناس" 
  ],
  "34 - برج بوعريريج": [ "عين تاغروت", "عين تسرة", "برج بوعريريج", "بليمور",
    "بن داود", "بئر قاصد علي", "برج الغدير", "برج زمورة", "القلة",
    "جعافرة", "العش", "الياشير", "العناصر", "الحمادية", "الماين",
    "المهير", "غيلاسة", "حرازة", "حسناوة", "خليل", "القصور",
    "المنصورة", "مجانة", "أولاد أبراهم", "أولاد دحمان",
    "أولاد سيدي إبراهيم", "الرابطة", "رأس الوادي", "سيدي أمبارك",
    "تفرق", "تقلعيت", "تسامرت", "ثنية النصر", "تيكستار"
  ],
    "35 - بومرداس": [ "أعفير", "عمال", "بغلية", "بن شود", "بني عمران",
    "برج منايل", "بودواو", "بودواو البحري", "بومرداس", "بوزقزة قدارة",
    "شعبة العامر", "قورصو", "دلس", "جنات", "الخروبة", "حمادي",
    "يسر", "خميس الخشنة", "الاربعطاش", "لقاطة", "الناصرية",
    "أولاد عيسى", "أولاد هداج", "أولاد موسى", "سي مصطفى",
    "سيدي داود", "سوق الحد", "تاورقة", "الثنية", "تيجلابين",
    "تيمزريت", "زموري"
  ],
  "36 - الطارف": [ "عين العسل", "عين الكرمة", "عصفور", "بن مهيدي",
    "بريحان", "البسباس", "بوقوس", "بوحجار", "بوثلجة",
    "شبيطة مختار", "الشافية", "شحاني", "الذرعان", "الشط",
    "العيون", "القالة", "الطارف", "حمام بني صالح", "بحيرة الطيور",
    "وادي الزيتون", "رمل السوق", "السوارخ", "زريزر", "الزيتونة"
  ],
  "37 - تندوف": [ "أم العسل", "تندوف"
  ],
  "38 - تيسمسيلت": [ "عماري", "بني شعيب", "بني لحسن", "برج بونعامة",
    "برج الأمير عبد القادر", "بوقائد", "خميستي", "الأربعاء", "لرجام",
    "العيون", "الأزهرية", "المعاصم", "الملعب", "أولاد بسام",
    "سيدي عابد", "سيدي بوتوشنت", "سيدي العنتري", "سيدي سليمان",
    "تملاحت", "ثنية الأحد", "تيسمسيلت", "اليوسفية"
  ],
  "39 - الوادي": [ "البياضة", "بن قشة", "الدبيلة", "دوار الماء",
    "العقلة", "الوادي", "قمار", "الحمراية", "حساني عبد الكريم",
    "حاسي خليفة", "كوينين", "المقرن", "أمية ونسة", "النخلة",
    "وادي العلندة", "ورماس", "الرقيبة", "الرباح", "سيدي عون",
    "تغزوت", "الطالب العربي", "الطريفاوي"
  ],
  "40 - خنشلة": [ "عين الطويلة", "بابار", "بغاي", "بوحمامة", "ششار",
    "شلية", "جلال", "الحامة", "المحمل", "الولجة", "انسيغة",
    "قايس", "خنشلة", "خيران", "مصارة", "متوسة", "أولاد رشاش",
    "الرميلة", "طامزة", "تاوزيانت", "يابوس"
  ],
  "41 - سوق أهراس": [ "عين سلطان", "عين الزانة", "بئر بوحوش", "الدريعة",
    "الحدادة", "الحنانشة", "الخضارة", "خميسة", "المشروحة", "مداروش",
    "المراهنة", "وادي الكبريت", "أولاد ادريس", "أولاد مومن", "أم العظايم",
    "ويلان", "الراقوبة", "سافل الويدان", "سدراتة", "سيدي فرج",
    "سوق أهراس", "تاورة", "ترقالت", "تيفاش", "الزعرورية", "الزوابي"
  ],
  "42 - تيبازة": [ "أغبال", "أحمر العين", "عين تاقورايت", "الحطاطبة",
    "بني ميلك", "بوهارون", "بواسماعيل", "بورقيقة", "الشعيبة",
    "شرشال", "الداماوس", "دواودة", "فوكة", "قوراية", "حجوط",
    "حجرة النص", "خميستي", "القليعة", "الأرهاط", "مناصر",
    "مراد", "مسلمون", "الناظور", "سيدي غيلاس", "سيدي راشد",
    "سيدي سميان", "سيدي عامر", "تيبازة"
  ],
  "43 - ميلة": [ "أحمد راشدي", "عين البيضاء أحريش", "عين الملوك", "عين التين",
    "عميرة أراس", "بن يحي عبد الرحمن", "بوحاتم", "شلغوم العيد", "الشيقارة",
    "دراحي بوصلاح", "العياضي برباس", "مشيرة", "فرجيوة", "القرارم قوقة",
    "حمالة", "ميلة", "مينار زارزة", "وادي العثمانية", "وادي النجاء",
    "وادي سقان", "أولاد خلوف", "الرواشد", "سيدي خليفة", "سيدي مروان",
    "تاجنانت", "تسدان حدادة", "التلاغمة", "ترعي باينان", "تسالة لمطاعي",
    "تيبرقنت", "يحي بني قشة", "زغاية"
  ],
  "44 - عين الدفلى": [ "عين البنيان", "عين بويحيى", "عين الدفلى", "عين الأشياخ",
    "عين السلطان", "عين التركي", "عريب", "بربوش", "بطحية", "بلعاص",
    "بن علال", "بئر ولد خليفة", "برج الأمير خالد", "بومدفع", "بوراشد",
    "جليدة", "جمعة أولاد الشيخ", "جندل", "العبادية", "العامرة", "العطاف",
    "الماين", "حمام ريغة", "الحسانية", "الحسينية", "خميس مليانة",
    "المخاطرية", "مليانة", "وادي الشرفاء", "واد الجمعة", "الروينة",
    "سيدي الأخضر", "تاشتة زقاغة", "طارق بن زياد", "تبركانين", "زدين"
  ],
  "45 - النعامة": [ "عين بن خليل", "عين الصفراء", "عسلة", "جنين بورزق",
    "البيوض", "القصدير", "مكمن بن عمار", "المشرية", "مغرار",
    "النعامة", "سفيسيفة", "تيوت"
  ],
  "46 - عين تموشنت": [ "آغلال", "عين الأربعاء", "عين الكيحل", "عين تموشنت",
    "عين الطلبة", "عقب الليل", "بني صاف", "بوزجار", "شعبة اللحم",
    "شنتوف", "العامرية", "المالح", "المساعيد", "الأمير عبد القادر",
    "حمح بوحجر", "الحساسنة", "حاسي الغلة", "وادي برقش",
    "وادي الصباح", "أولاد بوجمعة", "أولاد الكيحل", "ولهاصة الغرابة",
    "سيدي بن عدة", "سيدي بومدين", "سيدي ورياش", "سيدي صافي",
    "تامزورة", "تارقة"
  ],
  "47 - غرداية": [ "بريان", "بونورة", "ضاية بن ضحوة", "العطف",
    "غرداية", "القرارة", "المنصورة", "متليلي", "سبسب", "زلفانة"
  ],
  "48 - غليزان": [ "عين الرحمة", "عين طارق", "عمي موسى", "بلعسل بوزقزة",
    "بن داود", "بني درقن", "بني زنطيس", "دار بن عبد الله", "جديوية",
    "الحاسي", "الحمادنة", "الولجة", "القطار", "المطمر", "حد الشكالة",
    "حمري", "القلعة", "لحلاف", "مازونة", "مديونة", "منداس",
    "مرجة سيدي عابد", "واريزان", "وادي الجمعة", "وادي السلام",
    "وادي رهيو", "أولاد يعيش", "أولاد سيدي الميهوب", "الرمكة",
    "غليزان", "سيدي خطاب", "سيدي لزرق", "سيدي محمد بن علي",
    "سيدي محمد بن عودة", "سيدي سعادة", "سيدي الحد", "يلل", "زمورة"
  ],
  "49 - تيميمون": [ "أوقروت", "شروين", "دلدول", "قصر قدور", "المطارفة",
    "أولاد عيسى", "أولاد السعيد", "طالمين", "تيميمون", "تنركوك"
  ],
  "50 - برج باجي مختار": [ "برج باجي مختار", "تيمياوين" 
  ],
  "51 - أولاد جلال": [ "بسباس", "الشعيبة", "الدوسن", "أولاد جلال",
    "رأس الميعاد", "سيدي خالد"
  ],
  "52 - بني عباس": [ "بني عباس", "بن يخلف", "الواتة", "إقلي",
    "كرزاز", "القصابي", "أولاد خضير", "تبلبالة", "تامترت", "تيمودي"
  ],
  "53 - عين صالح": [ "عين صالح", "فقارة الزوى", "إينغر"  
  ],
  "54 - عين قزام": [ "عين قزام", "تين زواتين"
  ],
  "55 - تقرت": [ "بن ناصر", "بلدة أعمر", "العالية", "الحجيرة",
    "المقارين", "المنقر", "النزلة", "سيدي سليمان", "الطيبات",
    "تبسبست", "تماسين", "تقرت", "الزاوية العابدية"
  ],
  "56 - جانت": [ "برج الحواس", "جانت"
  ],
  "57 - المغير": [ "جامعة", "المغير", "المرارة", "أم الطيور",
    "سيدي عمران", "سيدي خليل", "سطيل", "تندلة"
  ],
  "58 - المنيعة": [ "المنيعة", "حاسي الفحل", "حاسي القارة" ]
};

const Confirm = () => {
  const [cartItem, setCartItem] = useState([]);
  const [deliveryPlace, setDeliveryPlace] = useState('office');
  const [selectedWilaya, setSelectedWilaya] = useState('');
  const [selectedCommune, setSelectedCommune] = useState('');
  const [showPopup,setShowPopup] = useState(false);
  const [loading, setLoading] = useState(false);
  const [toastMsg, setToastMsg] = useState('');
  const [showToast, setShowToast] = useState(false);

function showNotification(msg) {
  setToastMsg(msg);
  setShowToast(true);
  setTimeout(() => setShowToast(false), 2000);
}


  const deliveryPrice = deliveryPrices[selectedWilaya]?.[deliveryPlace] || 0;

  
    useEffect(() => {
      const handleCartUpdate = () => {
        const updatedCart = JSON.parse(localStorage.getItem("cart")) || [];
        setCartItem(updatedCart);
      };
  
      window.addEventListener("cart-updated", handleCartUpdate);
  
      return () => {
        window.removeEventListener("cart-updated", handleCartUpdate);
      };
    }, []);

  let [showDetail, setShowDetail] = useState(true);

    useEffect(() => {
      const cartContent = JSON.parse(localStorage.getItem("cart")) || [];
      setCartItem(cartContent);
    }, []);

  function handledetail(e) {
    if (e.target.checked) {
      setShowDetail(true);
    } else {
      setShowDetail(false);
    }
  }
  useEffect(() => {
    const timer = setTimeout(() => {
      document.querySelector('.confirm-container').style.opacity = 1;
    }, 200);

    return () => clearTimeout(timer);
  }, []);

  const handleConfirm = async (e) => {
    e.preventDefault();
  
    const days = ['Sunday', 'Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday'];
    const months = ['January', 'February', 'March', 'April', 'May', 'June', 'July', 'August', 'September', 'October', 'November', 'December'];
  
    const now = new Date();
    const dayName = days[now.getDay()];
    const day = String(now.getDate()).padStart(2, '0');
    const monthName = months[now.getMonth()];
    const year = now.getFullYear();
    const time = now.toLocaleTimeString('en-US', { hour: '2-digit', minute: '2-digit', hour12: false });
    const ConfirmDate = `${dayName}, ${day}/ ${monthName} /${year}, ${time}`;
  
    const nameInput = e.target.name;
    const phoneInput = e.target.phone;
    const wilayaSelect = e.target.wilaya;
    const communeSelect = e.target.commune;
    const deliveryPlaceInput = e.target.deliveryPlace;
    const instagramInput = e.target.instagram;
    const noteInput = e.target.note;
  
    const Name = nameInput.value.trim();
    const Phone = phoneInput.value.trim();
    const Wilaya = wilayaSelect.value.trim();
    const Commune = communeSelect.value.trim();
    const DeliveryPlace = deliveryPlaceInput.value === 'home' ? 'المنزل' : 'المكتب';
    const Instagram = instagramInput.value.trim();
    const Note = noteInput.value.trim();
    const State = "غير مأكد";
  
    const cartItem = JSON.parse(localStorage.getItem("cart")) || [];
  
    const cartItemsDetails = cartItem.map(item => ({
      id: item.theId,
      name: item.theName,
      price: item.thePrice,
      quantity: item.theQuantity,
      color: item.theColor,
      size: item.theSize,
      totalPrice: item.thePrice * item.theQuantity
    }));
  
    const Ids = cartItemsDetails.map(item => item.id ? `[${item.id}]` : '').join(', ');
    const Names = cartItemsDetails.map(item => item.name || '').join(', ');
    const Prices = cartItemsDetails.map(item => item.price ? `DZ ${item.price}` : '').join(', ');
    const Quantities = cartItemsDetails.map(item => item.quantity ? `[${item.quantity}]` : '').join(', ');
    const Colors = cartItemsDetails.map(item => item.color || '').join(', ');
    const Sizes = cartItemsDetails.map(item => item.size || '').join(', ');
    const OrderPrice = cartItemsDetails.reduce((total, item) => total + item.totalPrice, 0);
  
    const validateField = (condition, element) => {
      if (condition) {
        element.classList.remove("false");
      } else {
        element.classList.add("false");
        element.scrollIntoView({ behavior: "smooth", block: "center" });
      }
    };
  
    validateField(Name.length >= 3, nameInput);
    validateField(Phone.length === 10 && !isNaN(Number(Phone)), phoneInput);
    validateField(Wilaya !== "", wilayaSelect);
    validateField(Commune !== "", communeSelect);
  
    if (
      Name.length >= 3 &&
      Phone.length === 10 &&
      !isNaN(Number(Phone)) &&
      Wilaya !== "" &&
      Commune !== ""
    ) {
      const dataToSend = {
        ID : Ids,
        Order : Names,
        Full_Name: Name,
        Phone_Number : Phone,
        The_State : State,
        The_Wilaya : Wilaya,
        The_Commune : Commune,
        Delivery_Place: DeliveryPlace,
        Each_Item_Price: Prices,
        Order_Price : OrderPrice,
        Delivery_Price : deliveryPrice,
        Total_Price : OrderPrice + deliveryPrice,
        Order_Date : ConfirmDate,
        Each_Item_Quantity: Quantities,
        The_Colors : Colors,
        The_Sizes : Sizes,
        Instagram_Account : Instagram,
        Notes : Note,
      };

      const formData = new FormData();
      for (const key in dataToSend) {
        formData.append(key, dataToSend[key]);
      }

      setLoading(true);

      await fetch("https://script.google.com/macros/s/AKfycbxcfY_SHkycMY7uzjVE8t0fhlQBlnslDLmR49Ans9WnDRzhy68sdoAB27efTkLIHk8k/exec", {
        method: "POST",
        body: formData
      }).then((res)=>{
        setLoading(false);
        setShowPopup(true);
        localStorage.removeItem("cart");
        window.dispatchEvent(new Event("cart-updated"));
      }).catch((error) => {
    console.error("Error submitting form:", error);
    showNotification("حدث خطأ أثناء إرسال الطلب. حاول مرة أخرى.");
    });
    }
  };

  return ( 
    <div className="confirm-container container">
      {loading ? <Loader /> :
      <div className={`popup ${showPopup ? 'open-popup' : ''}`}>
        <i className="uil uil-check"></i>
          <h2>تم بنجاح</h2>
          <h5>سيتم تأكيد طلبك قريبًا نشكرك على اختيار خدماتنا</h5>
          <button type="button" onClick={()=>setShowPopup(false)}>OK</button>
      </div>
      }
      {cartItem.length > 0 ? (
        <form className="confirm-form" onSubmit={(e) => handleConfirm(e)}>
  <h5>معلومات الزبون</h5>

  <div className="form-row">
    <input type="text" placeholder="الإسم واللقب" name='name' className="input" />
    <input type="text" placeholder="رقم الهاتف" name='phone' className="input" />
  </div>

  {/* تغليف select بـ div لمنع الترجمة كليًا */}
  <div className="form-row" lang="zxx">
    <select
      className="select"
      name="wilaya"
      value={selectedWilaya || ""}
      onChange={(e) => {
        setSelectedWilaya(e.target.value);
        setSelectedCommune('');
      }}
    >
      <option value="" disabled>اختر الولاية</option>
      {Object.keys(deliveryPrices).map((wilaya) => (
        <option
          key={wilaya}
          value={wilaya}
          translate="no"
          lang="zxx"
        >
          {wilaya}
        </option>
      ))}
    </select>

    <select
      className="select"
      name='commune'
      value={selectedCommune || ""}
      disabled={!selectedWilaya || !communes[selectedWilaya]}
      onChange={(e) => setSelectedCommune(e.target.value)}
      style={{ cursor: (!selectedWilaya || !communes[selectedWilaya]) ? 'not-allowed' : 'pointer' }}
    >
      <option value="" disabled>اختر البلدية</option>
      {(communes[selectedWilaya] || []).map((commune) => (
        <option
          key={commune}
          value={commune}
          translate="no"
          lang="zxx"
        >
          {commune}
        </option>
      ))}
    </select>
  </div>

  <div className="last-row">
    <div>
      <div className="instagram">
        <input type="text" placeholder="حساب الانستغرام" name='instagram' className="input" />
        <i className="uil uil-instagram"></i>
      </div>
      <textarea name="note" placeholder='ملاحظات الزبون'></textarea>
    </div>

    <div className="delivery-place">
      <span>مكان التوصيل</span>

      <label>
        <input
          type="radio"
          name="deliveryPlace"
          value="office"
          checked={deliveryPlace === 'office'}
          onChange={() => setDeliveryPlace('office')}
        />
        للمكتب
        <span>
          {deliveryPrices[selectedWilaya]?.["office"] ? `${deliveryPrices[selectedWilaya]["office"]} دج` : ''}
        </span>
      </label>
 
      <label>
        <input
          type="radio"
          name="deliveryPlace"
          value="home"
          checked={deliveryPlace === 'home'}
          onChange={() => setDeliveryPlace('home')}
        />
        للمنزل
        <span>
          {deliveryPrices[selectedWilaya]?.["home"] ? `${deliveryPrices[selectedWilaya]["home"]} دج` : ''}
        </span>
      </label>
    </div>
  </div>

  <hr />

  <div className="summary">
    <div className="detail-row">
      <p>سعر المنتجات</p>
      <p>{cartItem.reduce((total, item) => total + item.thePrice * item.theQuantity, 0)} دج</p>
    </div>

    <div className="detail-row">
      <p>سعر التوصيل</p>
      {selectedWilaya === '' ? (
        <p>اختر الولاية و مكان التوصيل</p>
      ) : (
        <p>{deliveryPrice} دج</p>
      )}
    </div>

    <div className="detail-row">
      <p>التكلفة الإجمالية</p>
      <p className='price'>
        {cartItem.reduce((total, item) => total + item.thePrice * item.theQuantity, deliveryPrice)} دج
      </p>
    </div>
  </div>

  <button type="submit" className="order-btn">
    أطلب الآن <i className="uil uil-shopping-cart"></i>
  </button>
</form>

      ) : (
        <div className="empty-cart">
          <h3 className='mb-5'>سلّة التسوق الخاصة بك فارغة حالياً.</h3>
          <Link to="/" className="back-home">الإطلاع على المنتجات <i className="uil uil-arrow-left"></i></Link>
        </div>
      )}
      {cartItem.length > 0 && (
        <div className="details">
          <div>
          {cartItem.map((item,i) => (
            <Order
            key={item.i}
            id={item.theId}
            name={item.theName}
            price={item.thePrice}
            image={item.theImg}
            quantity={item.theQuantity}
            color={item.theColor}
            size={item.theSize}
            cartItem={cartItem}
            setCartItem={setCartItem}
            showNotification={showNotification}
          />

          ))}
          </div>
          <hr />
          <div className='confirm'>
            <div className="icon detail-row mb-3">
              <span>عرض التفاصيل</span>
              <label>
                <input className="toggle-checkbox" type="checkbox" defaultChecked onClick={(e)=>handledetail(e)}  />
                <div className="toggle-switch"></div>
              </label>
            </div>
          {
            showDetail ? cartItem.map((item,i)=>(
              <div className='detail-row' key={i}>
                <p>{item.theName} <i className="uil uil-multiply"></i> {item.theQuantity}</p>
                <p className='fw-bold'>{parseInt(item.thePrice * item.theQuantity)} دج</p>
              </div>
            )) : <div></div>
          }
          </div>
        </div>
      )}
    </div>    
  );
};

export default Confirm;
